# 'brew tap'
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homeport/tap"
tap "koekeishiya/formulae"
tap "kubeshark/kubeshark"
tap "smudge/smudge"
tap "vmware-tanzu/carvel"

# Casks
cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'appcleaner'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-monaspace'
cask 'font-monofur-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-recursive'
cask 'font-recursive-code'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'jetbrains-toolbox'
cask 'kap'
cask 'karabiner-elements'
cask 'kui'
cask 'logseq'
cask 'postman'
cask 'raycast'
cask 'session-manager-plugin'
cask 'spotify'
cask 'temurin'
cask 'temurin11'
cask 'temurin17'
cask 'temurin21'
cask 'the-unarchiver'
cask 'tidal'
cask 'todoist'
cask 'vagrant'
cask 'visual-studio-code'
cask 'visualvm'
