# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'homeport/tap'
tap 'koekeishiya/formulae'
tap 'kubeshark/kubeshark'
tap 'smudge/smudge'
tap 'vmware-tanzu/carvel'

# Formulas
brew 'asdf'
brew 'axel'
brew 'awscli'
brew 'curl'
brew 'devspace'
brew 'docker'
brew 'docker-buildx'
brew 'docker-completion'
brew 'fd'
brew 'fzf'
brew 'fx'
brew 'gh'
brew 'git'
brew 'git-absorb'
brew 'git-delta'
brew 'gnupg'
brew 'go-jsonnet'
brew 'grpcui'
brew 'grpcurl'
brew 'htop'
brew 'jsoncpp'
brew 'jsonnet'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kubeshark'
brew 'lazydocker'
brew 'lazygit'
brew 'node'
brew 'nightlight'
brew 'ntfs-3g'
brew 'python'
brew 'protobuf'
brew 'ripgrep'
brew 'rbenv'
brew 'rsync'
brew 'stern'
brew 'the_silver_searcher'
brew 'telnet'
brew 'tig'
brew 'tmux'
brew 'vendir'
brew 'watch'
brew 'wget'
brew 'yabai'
brew 'zsh'

# Casks
cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
cask 'appcleaner'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-monaspace'
cask 'font-monofur-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-recursive'
cask 'font-recursive-code'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'jetbrains-toolbox'
cask 'kap'
cask 'karabiner-elements'
cask 'keycastr'
cask 'kui'
cask 'logseq'
cask 'macfuse'
cask 'postman'
cask 'raycast'
cask 'session-manager-plugin'
cask 'slack'
cask 'spotify'
cask 'temurin'
cask 'temurin11'
cask 'temurin17'
cask 'temurin21'
cask 'the-unarchiver'
cask 'tidal'
cask 'todoist'
cask 'vagrant'
cask 'visual-studio-code'
cask 'visualvm'
