# Taps
tap 'dimentium/autoraise'
tap 'domt4/autoupdate'
tap 'FelixKratz/formulae'
tap 'koekeishiya/formulae'
tap 'nikitabobko/tap'
tap 'robinovitch61/tap'
tap 'vmware-tanzu/carvel'

# Formulas
brew 'antidote'
brew 'asdf'
brew 'ast-grep'
brew 'autoraise', restart_service: true
brew 'awscli'
brew 'axel'
brew 'bash'
brew 'bat'
brew 'bats-core'
brew 'borders', restart_service: true
brew 'curl'
brew 'devspace'
brew 'docker'
brew 'docker-buildx'
brew 'docker-completion'
brew 'eza'
brew 'fd'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-absorb'
brew 'git-delta'
brew 'git-extras'
brew 'git-machete'
brew 'gnupg'
brew 'go-jsonnet'
brew 'grpcui'
brew 'grpcurl'
brew 'htop'
brew 'humanlog'
brew 'jd'
brew 'jnv'
brew 'jq'
brew 'jsoncpp'
brew 'jsonnet'
# brew 'koekeishiya/formulae/skhd'
brew 'lazydocker'
brew 'lazygit'
brew 'luarocks'
brew 'markdown-toc'
brew 'markdownlint-cli2'
brew 'nightlight'
brew 'node'
# brew 'ntfs-3g'
brew 'nvm'
brew 'oh-my-posh'
brew 'prettier'
brew 'protobuf'
brew 'python'
brew 'rbenv'
brew 'ripgrep'
brew 'rsync'
brew 'sqlfluff'
brew 'stow'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'uv'
brew 'watch'
brew 'wget'
# brew 'yabai'
brew 'yamllint'
brew 'yq'
brew 'zsh'

# Casks
cask '1password'
cask '1password-cli'
cask 'nikitabobko/tap/aerospace'
# cask 'adobe-creative-cloud'
# cask 'adobe-creative-cloud-cleaner-tool'
cask 'alacritty'
cask 'android-commandlinetools'
cask 'android-platform-tools'
cask 'android-studio'
cask 'appcleaner'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-departure-mono'
cask 'font-iosevka-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-monaspace'
cask 'font-monofur-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-recursive'
cask 'font-recursive-code'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'jetbrains-toolbox'
cask 'kap'
cask 'keycastr'
cask 'logseq'
cask 'macfuse'
cask 'postman'
cask 'raycast'
cask 'session-manager-plugin'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tidal'
cask 'todoist'
# cask 'vault'
cask 'visual-studio-code'
cask 'visualvm'
cask 'wezterm'
